tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf25k50_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF25K50_H_
#define _PIC18LF25K50_H_

#define SRCON1                        0
#define SRRC1E                        1
#define SRRC2E                        2
#define SRRCKE                        3
#define SRRPE                         4
#define SRSC1E                        5
#define SRSC2E                        6
#define SRSCKE                        7
#define SRSPE                         8
#define SRCON0                        9
#define SRPR                          10
#define SRPS                          11
#define SRNQEN                        12
#define SRQEN                         13
#define SRCLK0                        14
#define SRCLK                         15
#define SRCLK1                        16
#define SRCLK2                        17
#define SRLEN                         18
#define CCPTMRS                       19
#define C1TSEL                        20
#define C2TSEL                        21
#define ANSELA                        22
#define ANSA0                         23
#define ANSA1                         24
#define ANSA2                         25
#define ANSA3                         26
#define ANSA5                         27
#define ANSELB                        28
#define ANSB0                         29
#define ANSB1                         30
#define ANSB2                         31
#define ANSB3                         32
#define ANSB4                         33
#define ANSB5                         34
#define ANSELC                        35
#define ANSC2                         36
#define ANSC6                         37
#define ANSC7                         38
#define UCON                          39
#define SUSPND                        40
#define RESUME                        41
#define USBEN                         42
#define PKTDIS                        43
#define SE0                           44
#define PPBRST                        45
#define USTAT                         46
#define PPBI                          47
#define DIR                           48
#define ENDP                          49
#define ENDP0                         50
#define ENDP1                         51
#define ENDP2                         52
#define ENDP3                         53
#define UCFG                          54
#define PPB                           55
#define UPP0                          56
#define PPB0                          57
#define UPP1                          58
#define PPB1                          59
#define FSEN                          60
#define UTRDIS                        61
#define UPUEN                         62
#define UOEMON                        63
#define UTEYE                         64
#define UADDR                         65
#define ADDR                          66
#define ADDR0                         67
#define ADDR1                         68
#define ADDR2                         69
#define ADDR3                         70
#define ADDR4                         71
#define ADDR5                         72
#define ADDR6                         73
#define UIE                           74
#define URSTIE                        75
#define UERRIE                        76
#define ACTVIE                        77
#define TRNIE                         78
#define IDLEIE                        79
#define STALLIE                       80
#define SOFIE                         81
#define UIR                           82
#define URSTIF                        83
#define UERRIF                        84
#define ACTVIF                        85
#define TRNIF                         86
#define IDLEIF                        87
#define STALLIF                       88
#define SOFIF                         89
#define UEIE                          90
#define PIDEE                         91
#define CRC5EE                        92
#define CRC16EE                       93
#define DFN8EE                        94
#define BTOEE                         95
#define BTSEE                         96
#define UEIR                          97
#define PIDEF                         98
#define CRC5EF                        99
#define CRC16EF                       100
#define DFN8EF                        101
#define BTOEF                         102
#define BTSEF                         103
#define UFRML                         104
#define FRML                          105
#define FRM0                          106
#define UFRML_FRM                     107
#define FRM1                          108
#define FRM2                          109
#define FRM3                          110
#define FRM4                          111
#define FRM5                          112
#define FRM6                          113
#define FRM7                          114
#define UFRMH                         115
#define FRM8                          116
#define UFRMH_FRM                     117
#define FRM9                          118
#define FRM10                         119
#define UEP0                          120
#define UEP0_EPSTALL                  121
#define EP0STALL                      122
#define EPSTALL0                      123
#define UEP0_EPINEN                   124
#define EPINEN0                       125
#define EP0INEN                       126
#define UEP0_EPOUTEN                  127
#define EP0OUTEN                      128
#define EPOUTEN0                      129
#define EPCONDIS0                     130
#define EP0CONDIS                     131
#define UEP0_EPCONDIS                 132
#define UEP0_EPHSHK                   133
#define EP0HSHK                       134
#define EPHSHK0                       135
#define UEP1                          136
#define EPSTALL1                      137
#define EP1STALL                      138
#define UEP1_EPSTALL                  139
#define EPINEN1                       140
#define EP1INEN                       141
#define UEP1_EPINEN                   142
#define EPOUTEN1                      143
#define UEP1_EPOUTEN                  144
#define EP1OUTEN                      145
#define UEP1_EPCONDIS                 146
#define EP1CONDIS                     147
#define EPCONDIS1                     148
#define EPHSHK1                       149
#define EP1HSHK                       150
#define UEP1_EPHSHK                   151
#define UEP2                          152
#define EP2STALL                      153
#define EPSTALL2                      154
#define UEP2_EPSTALL                  155
#define EP2INEN                       156
#define EPINEN2                       157
#define UEP2_EPINEN                   158
#define EP2OUTEN                      159
#define UEP2_EPOUTEN                  160
#define EPOUTEN2                      161
#define EP2CONDIS                     162
#define UEP2_EPCONDIS                 163
#define EPCONDIS2                     164
#define EP2HSHK                       165
#define EPHSHK2                       166
#define UEP2_EPHSHK                   167
#define UEP3                          168
#define UEP3_EPSTALL                  169
#define EPSTALL3                      170
#define EP3STALL                      171
#define UEP3_EPINEN                   172
#define EPINEN3                       173
#define EP3INEN                       174
#define EP3OUTEN                      175
#define EPOUTEN3                      176
#define UEP3_EPOUTEN                  177
#define UEP3_EPCONDIS                 178
#define EP3CONDIS                     179
#define EPCONDIS3                     180
#define EPHSHK3                       181
#define UEP3_EPHSHK                   182
#define EP3HSHK                       183
#define UEP4                          184
#define EP4STALL                      185
#define EPSTALL4                      186
#define UEP4_EPSTALL                  187
#define UEP4_EPINEN                   188
#define EP4INEN                       189
#define EPINEN4                       190
#define UEP4_EPOUTEN                  191
#define EPOUTEN4                      192
#define EP4OUTEN                      193
#define EPCONDIS4                     194
#define EP4CONDIS                     195
#define UEP4_EPCONDIS                 196
#define EPHSHK4                       197
#define EP4HSHK                       198
#define UEP4_EPHSHK                   199
#define UEP5                          200
#define EP5STALL                      201
#define UEP5_EPSTALL                  202
#define EPSTALL5                      203
#define EPINEN5                       204
#define UEP5_EPINEN                   205
#define EP5INEN                       206
#define EPOUTEN5                      207
#define UEP5_EPOUTEN                  208
#define EP5OUTEN                      209
#define EPCONDIS5                     210
#define EP5CONDIS                     211
#define UEP5_EPCONDIS                 212
#define UEP5_EPHSHK                   213
#define EPHSHK5                       214
#define EP5HSHK                       215
#define UEP6                          216
#define EPSTALL6                      217
#define UEP6_EPSTALL                  218
#define EP6STALL                      219
#define EP6INEN                       220
#define UEP6_EPINEN                   221
#define EPINEN6                       222
#define EP6OUTEN                      223
#define EPOUTEN6                      224
#define UEP6_EPOUTEN                  225
#define UEP6_EPCONDIS                 226
#define EP6CONDIS                     227
#define EPCONDIS6                     228
#define EPHSHK6                       229
#define UEP6_EPHSHK                   230
#define EP6HSHK                       231
#define UEP7                          232
#define UEP7_EPSTALL                  233
#define EP7STALL                      234
#define EPSTALL7                      235
#define EP7INEN                       236
#define EPINEN7                       237
#define UEP7_EPINEN                   238
#define EP7OUTEN                      239
#define UEP7_EPOUTEN                  240
#define EPOUTEN7                      241
#define UEP7_EPCONDIS                 242
#define EP7CONDIS                     243
#define EPCONDIS7                     244
#define EPHSHK7                       245
#define UEP7_EPHSHK                   246
#define EP7HSHK                       247
#define UEP8                          248
#define EPSTALL8                      249
#define UEP8_EPSTALL                  250
#define UEP8_EPINEN                   251
#define EPINEN8                       252
#define UEP8_EPOUTEN                  253
#define EPOUTEN8                      254
#define UEP8_EPCONDIS                 255
#define EPCONDIS8                     256
#define UEP8_EPHSHK                   257
#define EPHSHK8                       258
#define UEP9                          259
#define EPSTALL9                      260
#define UEP9_EPSTALL                  261
#define EPINEN9                       262
#define UEP9_EPINEN                   263
#define UEP9_EPOUTEN                  264
#define EPOUTEN9                      265
#define UEP9_EPCONDIS                 266
#define EPCONDIS9                     267
#define UEP9_EPHSHK                   268
#define EPHSHK9                       269
#define UEP10                         270
#define EPSTALL10                     271
#define UEP10_EPSTALL                 272
#define EPINEN10                      273
#define UEP10_EPINEN                  274
#define UEP10_EPOUTEN                 275
#define EPOUTEN10                     276
#define EPCONDIS10                    277
#define UEP10_EPCONDIS                278
#define UEP10_EPHSHK                  279
#define EPHSHK10                      280
#define UEP11                         281
#define UEP11_EPSTALL                 282
#define EPSTALL11                     283
#define EPINEN11                      284
#define UEP11_EPINEN                  285
#define UEP11_EPOUTEN                 286
#define EPOUTEN11                     287
#define EPCONDIS11                    288
#define UEP11_EPCONDIS                289
#define UEP11_EPHSHK                  290
#define EPHSHK11                      291
#define UEP12                         292
#define EPSTALL12                     293
#define UEP12_EPSTALL                 294
#define UEP12_EPINEN                  295
#define EPINEN12                      296
#define EPOUTEN12                     297
#define UEP12_EPOUTEN                 298
#define EPCONDIS12                    299
#define UEP12_EPCONDIS                300
#define EPHSHK12                      301
#define UEP12_EPHSHK                  302
#define UEP13                         303
#define UEP13_EPSTALL                 304
#define EPSTALL13                     305
#define EPINEN13                      306
#define UEP13_EPINEN                  307
#define UEP13_EPOUTEN                 308
#define EPOUTEN13                     309
#define EPCONDIS13                    310
#define UEP13_EPCONDIS                311
#define EPHSHK13                      312
#define UEP13_EPHSHK                  313
#define UEP14                         314
#define UEP14_EPSTALL                 315
#define EPSTALL14                     316
#define EPINEN14                      317
#define UEP14_EPINEN                  318
#define UEP14_EPOUTEN                 319
#define EPOUTEN14                     320
#define EPCONDIS14                    321
#define UEP14_EPCONDIS                322
#define UEP14_EPHSHK                  323
#define EPHSHK14                      324
#define UEP15                         325
#define UEP15_EPSTALL                 326
#define EPSTALL15                     327
#define UEP15_EPINEN                  328
#define EPINEN15                      329
#define UEP15_EPOUTEN                 330
#define EPOUTEN15                     331
#define EPCONDIS15                    332
#define UEP15_EPCONDIS                333
#define UEP15_EPHSHK                  334
#define EPHSHK15                      335
#define SLRCON                        336
#define SLRA                          337
#define SLRB                          338
#define SLRC                          339
#define VREFCON2                      340
#define DACR0                         341
#define DACR                          342
#define DACR1                         343
#define DACR2                         344
#define DACR3                         345
#define DACR4                         346
#define VREFCON1                      347
#define DACNSS                        348
#define DACPSS                        349
#define DACPSS0                       350
#define DACPSS1                       351
#define DACOE                         352
#define DACLPS                        353
#define DACEN                         354
#define VREFCON0                      355
#define TSRNG                         356
#define TSEN                          357
#define FVRS                          358
#define FVRS0                         359
#define FVRS1                         360
#define FVRST                         361
#define FVREN                         362
#define PMD0                          363
#define TMR1MD                        364
#define SPI1MD                        365
#define TMR2MD                        366
#define SPI2MD                        367
#define TMR3MD                        368
#define ACTMD                         369
#define STMD                          370
#define USBMD                         371
#define UARTMD                        372
#define UART1MD                       373
#define PMD1                          374
#define EMBMD                         375
#define CCP1MD                        376
#define CCP2MD                        377
#define ADCMD                         378
#define CMP1MD                        379
#define CMP2MD                        380
#define CTMUMD                        381
#define MSSPMD                        382
#define SSP1MD                        383
#define MSSP1MD                       384
#define PORTA                         385
#define ULPWUIN                       386
#define AN0                           387
#define PORTA_RA0                     388
#define AN1                           389
#define PORTA_RA1                     390
#define AN2                           391
#define PORTA_RA2                     392
#define VREFM                         393
#define AN3                           394
#define PORTA_RA3                     395
#define VREFP                         396
#define PORTA_RA4                     397
#define T0CKI                         398
#define AN4                           399
#define PORTA_RA5                     400
#define LVDIN                         401
#define HLVDIN                        402
#define PORTA_RA6                     403
#define OSC2                          404
#define PORTA_RA7                     405
#define RJPU                          406
#define PORTB                         407
#define INT0                          408
#define PORTB_RB0                     409
#define INT1                          410
#define PORTB_RB1                     411
#define INT2                          412
#define PORTB_RB2                     413
#define CCP2_PA2                      414
#define PORTB_RB3                     415
#define PORTB_RB4                     416
#define PGM                           417
#define PORTB_RB5                     418
#define PGC                           419
#define PORTB_RB6                     420
#define PGD                           421
#define PORTB_RB7                     422
#define PORTC                         423
#define T13CKI                        424
#define T1OSO                         425
#define PORTC_RC0                     426
#define CCP2                          427
#define T1OSI                         428
#define PA2                           429
#define PORTC_RC1                     430
#define CCP1                          431
#define P1A                           432
#define PA1                           433
#define PORTC_RC2                     434
#define RC4                           435
#define RC5                           436
#define TX                            437
#define CK                            438
#define PORTC_RC6                     439
#define DT                            440
#define RX                            441
#define PORTC_RC7                     442
#define PORTE                         443
#define RE3                           444
#define PC3E                          445
#define CCP9E                         446
#define WPUB                          447
#define WPUB0                         448
#define WPUB1                         449
#define WPUB2                         450
#define WPUB3                         451
#define WPUB4                         452
#define WPUB5                         453
#define WPUB6                         454
#define WPUB7                         455
#define IOCB                          456
#define IOCB4                         457
#define IOCB5                         458
#define IOCB6                         459
#define IOCB7                         460
#define IOCC                          461
#define IOCC0                         462
#define IOCC1                         463
#define IOCC2                         464
#define IOCC4                         465
#define IOCC5                         466
#define IOCC6                         467
#define IOCC7                         468
#define CTMUICON                      469
#define IRNG                          470
#define IRNG0                         471
#define IRNG1                         472
#define ITRIM0                        473
#define ITRIM                         474
#define ITRIM1                        475
#define ITRIM2                        476
#define ITRIM3                        477
#define ITRIM4                        478
#define ITRIM5                        479
#define LATA                          480
#define LATA0                         481
#define LA0                           482
#define LATA1                         483
#define LA1                           484
#define LATA2                         485
#define LA2                           486
#define LATA3                         487
#define LA3                           488
#define LATA4                         489
#define LA4                           490
#define LATA5                         491
#define LA5                           492
#define LATA6                         493
#define LA6                           494
#define LATA7                         495
#define LA7                           496
#define LATB                          497
#define LB0                           498
#define LATB0                         499
#define LB1                           500
#define LATB1                         501
#define LB2                           502
#define LATB2                         503
#define LB3                           504
#define LATB3                         505
#define LB4                           506
#define LATB4                         507
#define LB5                           508
#define LATB5                         509
#define LB6                           510
#define LATB6                         511
#define LB7                           512
#define LATB7                         513
#define LATC                          514
#define LATC0                         515
#define LC0                           516
#define LATC1                         517
#define LC1                           518
#define LATC2                         519
#define LC2                           520
#define LATC4                         521
