tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf25k50_tdd.h
#define LC4                           522
#define LATC5                         523
#define LC5                           524
#define LC6                           525
#define LATC6                         526
#define LATC7                         527
#define LC7                           528
#define CTMUCONL                      529
#define EDG1STAT                      530
#define EDG2STAT                      531
#define EDG1SEL                       532
#define EDG1SEL0                      533
#define EDG1SEL1                      534
#define EDG1POL                       535
#define EDG2SEL0                      536
#define EDG2SEL                       537
#define EDG2SEL1                      538
#define EDG2POL                       539
#define CTMUCONH                      540
#define TRIGEN                        541
#define CTTRIG                        542
#define IDISSEN                       543
#define EDGSEQEN                      544
#define EDGEN                         545
#define TGEN                          546
#define SIDL                          547
#define CTMUSIDL                      548
#define ON                            549
#define CTMUEN                        550
#define CCPR2L                        551
#define CCPR2H                        552
#define TRISA                         553
#define TRISA0                        554
#define TRISA_RA0                     555
#define TRISA1                        556
#define TRISA_RA1                     557
#define TRISA2                        558
#define TRISA_RA2                     559
#define TRISA3                        560
#define TRISA_RA3                     561
#define TRISA_RA4                     562
#define TRISA4                        563
#define TRISA_RA5                     564
#define TRISA5                        565
#define TRISA_RA6                     566
#define TRISA6                        567
#define TRISA_RA7                     568
#define TRISA7                        569
#define TRISB                         570
#define TRISB_RB0                     571
#define TRISB0                        572
#define TRISB_RB1                     573
#define TRISB1                        574
#define TRISB_RB2                     575
#define TRISB2                        576
#define TRISB_RB3                     577
#define TRISB3                        578
#define TRISB_RB4                     579
#define TRISB4                        580
#define TRISB_RB5                     581
#define TRISB5                        582
#define TRISB_RB6                     583
#define TRISB6                        584
#define TRISB_RB7                     585
#define TRISB7                        586
#define TRISC                         587
#define TRISC0                        588
#define TRISC_RC0                     589
#define TRISC1                        590
#define TRISC_RC1                     591
#define TRISC2                        592
#define TRISC_RC2                     593
#define TRISC4                        594
#define TRISC5                        595
#define TRISC6                        596
#define TRISC_RC6                     597
#define TRISC7                        598
#define TRISC_RC7                     599
#define CCP2CON                       600
#define CCP2M                         601
#define CCP2M0                        602
#define CCP2M1                        603
#define CCP2M2                        604
#define CCP2M3                        605
#define DC2B0                         606
#define CCP2Y                         607
#define DC2B                          608
#define DC2B1                         609
#define CCP2X                         610
#define CM1CON0                       611
#define C1CH                          612
#define C1CH0                         613
#define CM1CON0_CCH0                  614
#define CM1CON0_CCH                   615
#define CM1CON0_CCH1                  616
#define C1CH1                         617
#define CM1CON0_CREF                  618
#define C1R                           619
#define C1SP                          620
#define CM1CON0_CPOL                  621
#define C1POL                         622
#define CM1CON0_COE                   623
#define C1OE                          624
#define C1OUT                         625
#define COUT1                         626
#define CM1CON0_CON                   627
#define C1ON                          628
#define CM2CON0                       629
#define CM2CON0_CCH0                  630
#define C2CH0                         631
#define C2CH                          632
#define CM2CON0_CCH                   633
#define CM2CON0_CCH1                  634
#define C2CH1                         635
#define C2R                           636
#define CM2CON0_CREF                  637
#define C2SP                          638
#define C2POL                         639
#define CM2CON0_CPOL                  640
#define CM2CON0_COE                   641
#define C2OE                          642
#define C2OUT                         643
#define COUT2                         644
#define CM2CON0_CON                   645
#define C2ON                          646
#define CM2CON1                       647
#define C2SYNC                        648
#define C1SYNC                        649
#define C2HYS                         650
#define C1HYS                         651
#define C2RSEL                        652
#define C1RSEL                        653
#define MC2OUT                        654
#define MC1OUT                        655
#define OSCTUNE                       656
#define TUN0                          657
#define TUN                           658
#define TUN1                          659
#define TUN2                          660
#define TUN3                          661
#define TUN4                          662
#define TUN5                          663
#define TUN6                          664
#define SPLLMULT                      665
#define HLVDCON                       666
#define HLVDL                         667
#define HLVDL0                        668
#define HLVDL1                        669
#define HLVDL2                        670
#define HLVDL3                        671
#define HLVDEN                        672
#define IRVST                         673
#define BGVST                         674
#define VDIRMAG                       675
#define PIE1                          676
#define TMR1IE                        677
#define TMR2IE                        678
#define CCP1IE                        679
#define SSPIE                         680
#define SSP1IE                        681
#define TXIE                          682
#define TX1IE                         683
#define RCIE                          684
#define RC1IE                         685
#define ADIE                          686
#define STIE                          687
#define PSPIE                         688
#define ACTIE                         689
#define PIR1                          690
#define TMR1IF                        691
#define TMR2IF                        692
#define CCP1IF                        693
#define SSPIF                         694
#define SSP1IF                        695
#define TXIF                          696
#define TX1IF                         697
#define RCIF                          698
#define RC1IF                         699
#define ADIF                          700
#define PSPIF                         701
#define STIF                          702
#define ACTIF                         703
#define IPR1                          704
#define TMR1IP                        705
#define TMR2IP                        706
#define CCP1IP                        707
#define SSP1IP                        708
#define SSPIP                         709
#define TX1IP                         710
#define TXIP                          711
#define RC1IP                         712
#define RCIP                          713
#define ADIP                          714
#define ACTIP                         715
#define PSPIP                         716
#define STIP                          717
#define PIE2                          718
#define CCP2IE                        719
#define TMR3IE                        720
#define HLVDIE                        721
#define LVDIE                         722
#define BCLIE                         723
#define BCL1IE                        724
#define EEIE                          725
#define C2IE                          726
#define CM2IE                         727
#define C1IE                          728
#define CMIE                          729
#define CM1IE                         730
#define OSCFIE                        731
#define PIR2                          732
#define CCP2IF                        733
#define TMR3IF                        734
#define HLVDIF                        735
#define LVDIF                         736
#define BCLIF                         737
#define BCL1IF                        738
#define EEIF                          739
#define C2IF                          740
#define CM2IF                         741
#define C1IF                          742
#define CMIF                          743
#define CM1IF                         744
#define OSCFIF                        745
#define IPR2                          746
#define CCP2IP                        747
#define TMR3IP                        748
#define HLVDIP                        749
#define LVDIP                         750
#define BCL1IP                        751
#define BCLIP                         752
#define EEIP                          753
#define CM2IP                         754
#define C2IP                          755
#define CM1IP                         756
#define C1IP                          757
#define CMIP                          758
#define OSCFIP                        759
#define PIE3                          760
#define TMR1GIE                       761
#define RXB0IE                        762
#define RXBNIE                        763
#define TMR3GIE                       764
#define RXB1IE                        765
#define USBIE                         766
#define TXB0IE                        767
#define TXB1IE                        768
#define CTMUIE                        769
#define PIR3                          770
#define TMR1GIF                       771
#define RXBNIF                        772
#define TMR3GIF                       773
#define USBIF                         774
#define CTMUIF                        775
#define IPR3                          776
#define TMR1GIP                       777
#define TMR3GIP                       778
#define RXBNIP                        779
#define USBIP                         780
#define CTMUIP                        781
#define EECON1                        782
#define RD                            783
#define WR                            784
#define WREN                          785
#define WRERR                         786
#define FREE                          787
#define CFGS                          788
#define EEFS                          789
#define EEPGD                         790
#define EECON2                        791
#define RCSTA1                        792
#define RCD8                          793
#define RX9D                          794
#define OERR                          795
#define FERR                          796
#define ADDEN                         797
#define ADEN                          798
#define CREN                          799
#define SREN                          800
#define SRENA                         801
#define RC8_9                         802
#define RC9                           803
#define RX9                           804
#define SPEN                          805
#define TXSTA1                        806
#define TXD8                          807
#define TX9D1                         808
#define TX9D                          809
#define TRMT                          810
#define TRMT1                         811
#define BRGH1                         812
#define BRGH                          813
#define SENDB1                        814
#define SENDB                         815
#define SYNC                          816
#define SYNC1                         817
#define TXEN1                         818
#define TXEN                          819
#define TX91                          820
#define TX8_9                         821
#define TX9                           822
#define CSRC1                         823
#define CSRC                          824
#define TXREG1                        825
#define RCREG1                        826
#define BRG0                          827
#define SPBRG1                        828
#define BRG1                          829
#define BRG2                          830
#define BRG3                          831
#define BRG4                          832
#define BRG5                          833
#define BRG6                          834
#define BRG7                          835
#define BRG8                          836
#define SPBRGH1                       837
#define BRG9                          838
#define BRG10                         839
#define BRG11                         840
#define BRG12                         841
#define BRG13                         842
#define BRG14                         843
#define BRG15                         844
#define T3CON                         845
#define TMR3ON                        846
#define T3CON_RD16                    847
#define T3RD16                        848
#define nT3SYNC                       849
#define NOT_T3SYNC                    850
#define T3SYNC                        851
#define SOSCEN3                       852
#define T3SOSCEN                      853
#define T3OSCEN                       854
#define T3CON_SOSCEN                  855
#define T3CKPS0                       856
#define T3CKPS                        857
#define T3CKPS1                       858
#define TMR3CS0                       859
#define TMR3CS                        860
#define TMR3CS1                       861
#define RD163                         862
#define TMR3L                         863
#define TMR3H                         864
#define T3GCON                        865
#define T3GSS0                        866
#define T3GSS                         867
#define T3GSS1                        868
#define T3GVAL                        869
#define T3GGO_NOT_DONE                870
#define T3GGO                         871
#define T3GGO_nDONE                   872
#define T3DONE                        873
#define NOT_T3DONE                    874
#define nT3DONE                       875
#define T3GGO_nT3DONE                 876
#define T3GGO_NOT_T3DONE              877
#define T3GSPM                        878
#define T3GTM                         879
#define T3GPOL                        880
#define TMR3GE                        881
#define ACTCON                        882
#define STOR                          883
#define ACTORS                        884
#define ACTOR                         885
#define STLOCK                        886
#define ACTLOCK                       887
#define STSRC                         888
#define ACTSRC                        889
#define STUD                          890
#define ACTUD                         891
#define ACTD                          892
#define ACTEN                         893
#define STEN                          894
#define ACTSEL                        895
#define P1SSBD                        896
#define PSSBD0                        897
#define PSS1BD0                       898
#define PSS1BD                        899
#define PSSBD1                        900
#define PSS1BD1                       901
#define PSSAC0                        902
#define P1SSAC                        903
#define PSS1AC                        904
#define PSS1AC0                       905
#define PSSAC1                        906
#define PSS1AC1                       907
#define ECCP1AS                       908
#define CCP1AS                        909
#define ECCP1AS0                      910
#define ECCP1AS1                      911
#define ECCP1AS2                      912
#define CCP1ASE                       913
#define ECCP1ASE                      914
#define PWM1CON                       915
#define PDC0                          916
#define P1DC                          917
#define PDC1                          918
#define PDC2                          919
#define PDC3                          920
#define PDC4                          921
#define PDC5                          922
#define PDC6                          923
#define P1RSEN                        924
#define PR1SEN                        925
#define BAUDCON1                      926
#define ABDEN1                        927
#define ABDEN                         928
#define WUE1                          929
#define W4E                           930
#define WUE                           931
#define BRG161                        932
#define BRG16                         933
#define CKTXP                         934
#define SCKP1                         935
#define TXCKP                         936
#define TXCKP1                        937
#define SCKP                          938
#define DTRXP1                        939
#define RXDTP1                        940
#define DTRXP                         941
#define RXCKP                         942
#define RXDTP                         943
#define RCMT1                         944
#define RCIDL1                        945
#define RCIDL                         946
#define RCMT                          947
#define ABDOVF                        948
#define ABDOVF1                       949
#define PSTR1CON                      950
#define STR1A                         951
#define STRA                          952
#define STR1B                         953
#define STRB                          954
#define STR1C                         955
#define STRC                          956
#define STR1D                         957
#define STRD                          958
#define STR1SYNC                      959
#define STRSYNC                       960
#define T2CON                         961
#define T2CKPS0                       962
#define T2CKPS                        963
#define T2CKPS1                       964
#define TMR2ON                        965
#define T2OUTPS0                      966
#define T2OUTPS                       967
#define T2OUTPS1                      968
#define T2OUTPS2                      969
#define T2OUTPS3                      970
#define PR2                           971
#define TMR2                          972
#define CCP1CON                       973
#define CCP1M0                        974
#define CCP1M                         975
#define CCP1M1                        976
#define CCP1M2                        977
#define CCP1M3                        978
#define CCP1Y                         979
#define DC1B                          980
#define DC1B0                         981
#define CCP1X                         982
#define DC1B1                         983
#define P1M                           984
#define P1M0                          985
#define P1M1                          986
#define CCPR1L                        987
#define CCPR1H                        988
#define ADCON2                        989
#define ADCS0                         990
#define ADCS                          991
#define ADCS1                         992
#define ADCS2                         993
#define ACQT0                         994
#define ACQT                          995
#define ACQT1                         996
#define ACQT2                         997
#define ADFM                          998
#define ADCON1                        999
#define NVCFG                         1000
#define NVCFG0                        1001
#define NVCFG1                        1002
#define PVCFG                         1003
#define PVCFG0                        1004
#define CHSN3                         1005
#define PVCFG1                        1006
#define TRIGSEL                       1007
#define ADCON0                        1008
#define ADON                          1009
#define nDONE                         1010
#define GODONE                        1011
#define GO_nDONE                      1012
#define NOT_DONE                      1013
#define GO_DONE                       1014
#define DONE                          1015
#define GO                            1016
#define GO_NOT_DONE                   1017
#define CHS                           1018
#define SSP1CON2                      1019
#define SEN1                          1020
#define SEN                           1021
#define ADMSK11                       1022
#define RSEN1                         1023
#define RSEN                          1024
#define ADMSK1                        1025
#define PEN                           1026
#define ADMSK21                       1027
#define PEN1                          1028
#define ADMSK2                        1029
#define ADMSK31                       1030
#define RCEN                          1031
#define RCEN1                         1032
#define ADMSK3                        1033
#define ACKEN                         1034
#define ACKEN1                        1035
#define ADMSK41                       1036
#define ADMSK4                        1037
#define ACKDT1                        1038
#define ADMSK51                       1039
#define ADMSK5                        1040
#define ACKDT                         1041
#define ACKSTAT                       1042
#define ACKSTAT1                      1043
#define GCEN                          1044
#define GCEN1                         1045
#define SSP1CON1                      1046
#define SSPM0                         1047
#define SSPM                          1048
#define SSPM01                        1049
#define SSPM1                         1050
#define SSPM11                        1051
#define SSPM2                         1052
#define SSPM21                        1053
#define SSPM31                        1054
#define SSPM3                         1055
#define CKP                           1056
#define CKP1                          1057
#define SSPEN                         1058
#define SSPEN1                        1059
#define SSPOV1                        1060
#define SSPOV                         1061
#define WCOL1                         1062
#define WCOL                          1063
#define SSP1STAT                      1064
#define BF                            1065
#define BF1                           1066
#define UA1                           1067
#define UA                            1068
#define R_NOT_W                       1069
#define READ_WRITE                    1070
#define RW1                           1071
#define NOT_W                         1072
#define R_W                           1073
#define RW                            1074
#define R                             1075
#define nWRITE                        1076
#define nW                            1077
#define R_nW                          1078
#define I2C_READ                      1079
#define START                         1080
#define START1                        1081
#define S                             1082
#define I2C_START                     1083
#define STOP                          1084
#define I2C_STOP                      1085
#define STOP1                         1086
#define P                             1087
#define NOT_A                         1088
#define DATA_ADDRESS                  1089
#define nA                            1090
